## 정렬과 순위

In [1]:
import numpy as np
import pandas as pd
from pandas import DataFrame, Series

In [2]:
obj = Series(range(4), index=['d', 'a', 'b', 'c'])

* 로우나 컬럼의 색인을 알파벳 순으로 정렬하려면 정렬된 새로운 객체를 반환하는 sort_index 메서드를 사용한다.

In [3]:
obj.sort_index()

a    1
b    2
c    3
d    0
dtype: int64

* DataFrame은 로우나 컬럼 중 하나의 축을 기준으로 정렬할 수 있다.

In [4]:
frame = DataFrame(np.arange(8).reshape((2, 4)), index=['three', 'one'],
                  columns=['d', 'a', 'b', 'c'])

In [5]:
frame

       d  a  b  c
three  0  1  2  3
one    4  5  6  7

In [6]:
frame.sort_index()

       d  a  b  c
one    4  5  6  7
three  0  1  2  3

In [7]:
frame.sort_index(axis=1)

       a  b  c  d
three  1  2  3  0
one    5  6  7  4

* 내림차순으로 정렬할 수도 있다.

In [8]:
frame.sort_index(axis=1, ascending=False)

       d  c  b  a
three  0  3  2  1
one    4  7  6  5

In [9]:
array = np.array([5, 6, 7, 8, 1, 9, 10, 15])

In [10]:
array

array([ 5,  6,  7,  8,  1,  9, 10, 15])

In [11]:
frame1 = DataFrame(array.reshape(2, 4),
                   index=['c', 'a'], columns=['dd', 'aa', 'cc', 'bb'])

In [12]:
frame1

   dd  aa  cc  bb
c   5   6   7   8
a   1   9  10  15

In [13]:
frame1.sort_index()

   dd  aa  cc  bb
a   1   9  10  15
c   5   6   7   8

In [14]:
frame1.sort_index(axis=1)

   aa  bb  cc  dd
c   6   8   7   5
a   9  15  10   1

- Series 객체를 값에 따라 정렬하고 싶다면 sort_values 메서드를 사용한다.

In [15]:
obj = Series([4, 7, -3, 2])

In [16]:
obj.sort_values()

2   -3
3    2
0    4
1    7
dtype: int64

- 정렬할 때 비어있는 값은 기본적으로 Series 객체에서 가장 마지막에 위치한다.

In [17]:
obj = Series([4, np.nan, 7, np.nan, -3, 2])

In [18]:
obj.sort_values()

4   -3.0
5    2.0
0    4.0
2    7.0
1    NaN
3    NaN
dtype: float64

- DataFrame에서는 컬럼에 있는 값으로 정렬이 필요할 수 있다.
- by 옵션에 정렬이 필요한 컬럼의 이름을 넘긴다.

In [19]:
frame = DataFrame({'b': [4, 7, -3, 2], 'a': [0, 1, 0, 1]})

In [20]:
frame

   a  b
0  0  4
1  1  7
2  0 -3
3  1  2

In [21]:
frame.sort_values(by='b')

   a  b
2  0 -3
3  1  2
0  0  4
1  1  7

- 여러 개의 컬럼을 정렬하려면 컬럼의 이름이 담긴 리스트를 전달한다.

In [22]:
frame.sort_values(by=['a', 'b'])

   a  b
2  0 -3
0  0  4
3  1  2
1  1  7

- 순위는 정렬과 거의 유사하다.
- 1부터 배열의 유효한 데이터 개수까지의 순위를 매긴다.
- numpy.argsort에서 반환하는 간접 정렬 색인과 유사하지만 동률인 순위를 처리하는 방식이 다르다.
- 기본적으로 Series와 DataFrame의 rank 메서드는 동점인 항목에 대해서는 평균 순위를 매긴다.

In [23]:
obj = Series([7, -5, 7, 4, 2, 0, 4])

In [24]:
obj.rank()

0    6.5
1    1.0
2    6.5
3    4.5
4    3.0
5    2.0
6    4.5
dtype: float64

- 데이터 상에서 나타나는 순서에 따라 순위를 매길 수도 있다.

In [25]:
obj.rank(method='first')

0    6.0
1    1.0
2    7.0
3    4.0
4    3.0
5    2.0
6    5.0
dtype: float64

- 내림차순으로 순위를 매길 수도 있다.

In [26]:
obj.rank(ascending=False, method='max')

0    2.0
1    7.0
2    2.0
3    4.0
4    5.0
5    6.0
6    4.0
dtype: float64

* method='min'을 사용하는 것이 가장 예상과 가까운 결과를 얻을 수 있다.

In [27]:
obj.rank(method='min')

0    6.0
1    1.0
2    6.0
3    4.0
4    3.0
5    2.0
6    4.0
dtype: float64

- DataFrame에서는 로우나 컬럼에 대해 순위를 정할 수 있다.

In [28]:
frame = DataFrame({'b': [4.3, 7, -3, 2], 'a': [0, 1, 0, 1],
                   'c': [-2, 5, 8, -2.5]})

In [29]:
frame

   a    b    c
0  0  4.3 -2.0
1  1  7.0  5.0
2  0 -3.0  8.0
3  1  2.0 -2.5

In [30]:
frame.rank(axis=1)

     a    b    c
0  2.0  3.0  1.0
1  1.0  3.0  2.0
2  2.0  1.0  3.0
3  2.0  3.0  1.0

- average: 기본값, 같은 값을 가지는 항목의 평균 값을 순위로 삼는다.
- min: 같은 값을 가지는 그룹을 낮은 순위로 매긴다.
- max: 같은 값을 가지는 그룹을 높은 순위로 매긴다.
- first: 데이터 내에서 위치에 따라 순위를 매긴다.

## 중복 색인

In [31]:
obj = Series(range(5), index=['a', 'a', 'b', 'b', 'c'])

In [32]:
obj

a    0
a    1
b    2
b    3
c    4
dtype: int64

- 색인의 is_unique 속성은 해당 값이 유일하면 True 유일하지 않다면 False를 반환한다.

In [33]:
obj.index.is_unique

False

- 중복되는 색인 값이 있으면 색인을 이용한 데이터 선택은 Series 객체를 반환한다.
- 중복되는 색인 값이 없으면 색인을 이용한 데이터 선택은 스칼라 값을 반환한다.

In [34]:
obj['a']

a    0
a    1
dtype: int64

In [35]:
obj['c']

4

- DataFrame에서 row를 선택하는 것도 동일하다.

In [36]:
df = DataFrame(np.random.randn(4, 3), index=['a', 'a', 'b', 'b'])

In [37]:
df

          0         1         2
a -0.865834  0.442142  0.492779
a  1.248269  0.134559  1.119651
b -0.108997  1.059830 -0.676641
b  1.801773  1.550487 -1.667632

In [38]:
df.loc['a']

          0         1         2
a -0.865834  0.442142  0.492779
a  1.248269  0.134559  1.119651

## 기술통계 계산과 요약

- pandas 객체는 일반적인 수학 메서드와 통계 메서드를 가지고 있다.
- 이 메서드는 대부분 Series나 DataFrame 하나의 칼럼이나 로우에서 단일 값(합이나 평균 같은)을 구하는 축소 혹은 요약통계 범주에 속한다.
- numpy 배열에서 제공하는 동일한 메서드와 비교하여 pandas의 메서드는 처음부터 누락된 데이터를 제외하도록 설계되었다.

In [39]:
df = DataFrame([[1.4, np.nan], [7.1, -4.5],
                [np.nan, np.nan], [0.75, -1.3]],
               index = ['a', 'b', 'c', 'd'],
               columns=['one', 'two'])

In [40]:
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

- DafaFrame의 sum 메서드를 호출하면 각 칼럼의 합을 담은 Series를 반환한다.

In [41]:
df.sum()

one    9.25
two   -5.80
dtype: float64

* axis=1 옵션을 전달하면 로우의 합을 반환한다.

In [42]:
df.sum(axis=1)

a    1.40
b    2.60
c    0.00
d   -0.55
dtype: float64

- NaN을 제외하는 것은 skipna 옵션으로 조정할 수 있다.

In [43]:
df.mean(axis=1, skipna=False)

a      NaN
b    1.300
c      NaN
d   -0.275
dtype: float64

In [44]:
df.mean(axis=1)

a    1.400
b    1.300
c      NaN
d   -0.275
dtype: float64

- 공통적으로 사용되는 옵션은 다음과 같다.
- axis: 연산을 수행할 축. DataFrame에서 0은 로우, 1은 칼럼
- skipna: 누락된 값을 포함/제외를 설정. 기본 값은 True
- level: 계산하려는 축이 계층적 색인(다중 색인)이라면 레벨에 따라 묶어서 계산한다.

- idxmin, idxmax 메서드는 최소 혹은 최대 값을 가지고 있는 색인 값을 반환한다.

In [45]:
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [46]:
df.idxmin()

one    d
two    b
dtype: object

In [47]:
df.idxmin(axis=1)

a    one
b    two
c    NaN
d    two
dtype: object

In [48]:
df.idxmax()

one    b
two    d
dtype: object

In [49]:
df.cumsum()

    one  two
a  1.40  NaN
b  8.50 -4.5
c   NaN  NaN
d  9.25 -5.8

- 누적합 cumsum은 skipna 옵션에 영향을 받지 않는다.

In [50]:
df.cumsum(skipna=True)

    one  two
a  1.40  NaN
b  8.50 -4.5
c   NaN  NaN
d  9.25 -5.8

- describe 메서드는 한 번에 통계 결과를 여러 개 만들어 낸다.

In [51]:
df.describe()

            one       two
count  3.000000  2.000000
mean   3.083333 -2.900000
std    3.493685  2.262742
min    0.750000 -4.500000
25%    1.075000 -3.700000
50%    1.400000 -2.900000
75%    4.250000 -2.100000
max    7.100000 -1.300000

- describe는 수치 데이터가 아닐 경우 다른 요약통계를 생성한다.

In [52]:
obj = Series(['a', 'a', 'b', 'c'] * 4)

In [53]:
obj

0     a
1     a
2     b
3     c
4     a
5     a
6     b
7     c
8     a
9     a
10    b
11    c
12    a
13    a
14    b
15    c
dtype: object

In [54]:
obj.describe()

count     16
unique     3
top        a
freq       8
dtype: object

## 상관관계와 공분산

In [55]:
import pandas as pd
from pandas_datareader import data
import fix_yahoo_finance as yf
yf.pdr_override()

all_data = {}
for ticker in ['AAPL', 'IBM', 'MSFT', 'GOOG']:
    all_data[ticker] = data.get_data_yahoo(ticker, '2015-1-1', '2016-1-1')

[*********************100%***********************]  1 of 1 downloaded
[*********************100%***********************]  1 of 1 downloaded
[*********************100%***********************]  1 of 1 downloaded
[*********************100%***********************]  1 of 1 downloaded

In [56]:
all_data

{'AAPL':                   Open        High         Low       Close   Adj Close  \
 Date
 2014-12-31  112.820000  113.129997  110.209999  110.379997  104.064095
 2015-01-02  111.389999  111.440002  107.349998  109.330002  103.074188
 2015-01-05  108.290001  108.650002  105.410004  106.250000  100.170403
 2015-01-06  106.540001  107.430000  104.629997  106.260002  100.179832
 2015-01-07  107.199997  108.199997  106.699997  107.750000  101.584587
 2015-01-08  109.230003  112.150002  108.699997  111.889999  105.487694
 2015-01-09  112.669998  113.250000  110.209999  112.010002  105.600815
 2015-01-12  112.599998  112.629997  108.800003  109.250000  102.998756
 2015-01-13  111.430000  112.800003  108.910004  110.220001  103.913254
 2015-01-14  109.040001  110.489998  108.500000  109.800003  103.517303
 2015-01-15  110.000000  110.059998  106.660004  106.820000  100.707787
 2015-01-16  107.029999  107.580002  105.199997  105.989998   99.925301
 2015-01-20  107.839996  108.970001  106.500000  108.720001  102.499077
 2015-01-21  108.949997  111.059998  108.269997  109.550003  103.281609
 2015-01-22  110.260002  112.470001  109.720001  112.400002  105.968506
 2015-01-23  112.300003  113.750000  111.529999  112.980003  106.515327
 2015-01-26  113.739998  114.360001  112.800003  113.099998  106.628448
 2015-01-27  112.419998  112.480003  109.029999  109.139999  102.895050
 2015-01-28  117.629997  118.120003  115.309998  115.309998  108.712013
 2015-01-29  116.320000  119.190002  115.559998  118.900002  112.096588
 2015-01-30  118.400002  120.000000  116.849998  117.160004  110.456161
 2015-02-02  118.050003  119.169998  116.080002  118.629997  111.842026
 2015-02-03  118.500000  119.089996  117.610001  118.650002  111.860893
 2015-02-04  118.500000  120.510002  118.309998  119.559998  112.718803
 2015-02-05  120.019997  120.230003  119.250000  119.940002  113.523354
 2015-02-06  120.019997  120.250000  118.449997  118.930000  112.567368
 2015-02-09  118.550003  119.839996  118.430000  119.720001  113.315125
 2015-02-10  120.169998  122.150002  120.160004  122.019997  115.492058
 2015-02-11  122.769997  124.919998  122.500000  124.879997  118.199066
 2015-02-12  126.059998  127.480003  125.570000  126.459999  119.694534
 ...                ...         ...         ...         ...         ...
 2015-11-18  115.760002  117.489998  115.500000  117.290001  112.462791
 2015-11-19  117.639999  119.750000  116.760002  118.779999  113.891464
 2015-11-20  119.199997  119.919998  118.849998  119.300003  114.390068
 2015-11-23  119.269997  119.730003  117.339996  117.750000  112.903854
 2015-11-24  117.330002  119.349998  117.120003  118.879997  113.987350
 2015-11-25  119.209999  119.230003  117.919998  118.029999  113.172325
 2015-11-27  118.290001  118.410004  117.599998  117.809998  112.961395
 2015-11-30  117.989998  119.410004  117.750000  118.300003  113.431229
 2015-12-01  118.750000  118.809998  116.860001  117.339996  112.510719
 2015-12-02  117.339996  118.110001  116.080002  116.279999  111.494362
 2015-12-03  116.550003  116.790001  114.220001  115.199997  110.458809
 2015-12-04  115.290001  119.250000  115.110001  119.029999  114.131172
 2015-12-07  118.980003  119.860001  117.809998  118.279999  113.412041
 2015-12-08  117.519997  118.599998  116.860001  118.230003  113.364113
 2015-12-09  117.639999  117.690002  115.080002  115.620003  110.861519
 2015-12-10  116.040001  116.940002  115.510002  116.169998  111.388885
 2015-12-11  115.190002  115.389999  112.849998  113.180000  108.521942
 2015-12-14  112.180000  112.680000  109.790001  112.480003  107.850754
 2015-12-15  111.940002  112.800003  110.349998  110.489998  105.942650
 2015-12-16  111.070000  111.989998  108.800003  111.339996  106.757668
 2015-12-17  112.019997  112.250000  108.980003  108.980003  104.494812
 2015-12-18  108.910004  109.519997  105.809998  106.029999  101.666206
 2015-12-21  107.279999  107.370003  105.570000  107.330002  102.912712
 2015-12-22  107.400002  107.720001  106.449997  107.230003  102.816826
 2015-12-23  107.269997  108.849998  107.199997  108.610001  104.140030
 2015-12-24  109.000000  109.000000  107.949997  108.029999  103.583885
 2015-12-28  107.589996  107.690002  106.180000  106.820000  102.423691
 2015-12-29  106.959999  109.430000  106.860001  108.739998  104.264664
 2015-12-30  108.580002  108.699997  107.180000  107.320000  102.903107
 2015-12-31  107.010002  107.029999  104.820000  105.260002  100.927902

                Volume
 Date
 2014-12-31   41403400
 2015-01-02   53204600
 2015-01-05   64285500
 2015-01-06   65797100
 2015-01-07   40105900
 2015-01-08   59364500
 2015-01-09   53699500
 2015-01-12   49650800
 2015-01-13   67091900
 2015-01-14   48337000
 2015-01-15   60014000
 2015-01-16   78513300
 2015-01-20   49899900
 2015-01-21   48575900
 2015-01-22   53796400
 2015-01-23   46464800
 2015-01-26   55615000
 2015-01-27   95568700
 2015-01-28  146477100
 2015-01-29   84436400
 2015-01-30   83745500
 2015-02-02   62739100
 2015-02-03   51915700
 2015-02-04   70149700
 2015-02-05   42246200
 2015-02-06   43706600
 2015-02-09   38889800
 2015-02-10   62008500
 2015-02-11   73561800
 2015-02-12   74474500
 ...               ...
 2015-11-18   46674700
 2015-11-19   43295800
 2015-11-20   34287100
 2015-11-23   32482500
 2015-11-24   42803200
 2015-11-25   21388300
 2015-11-27   13046400
 2015-11-30   39180300
 2015-12-01   34852400
 2015-12-02   33386600
 2015-12-03   41569500
 2015-12-04   57777000
 2015-12-07   32084200
 2015-12-08   34309500
 2015-12-09   46361400
 2015-12-10   29104200
 2015-12-11   46886200
 2015-12-14   64318700
 2015-12-15   53323100
 2015-12-16   56238500
 2015-12-17   44772800
 2015-12-18   96453300
 2015-12-21   47590600
 2015-12-22   32789400
 2015-12-23   32657400
 2015-12-24   13570400
 2015-12-28   26704200
 2015-12-29   30931200
 2015-12-30   25213800
 2015-12-31   40635300

 [253 rows x 6 columns],
 'GOOG':                   Open        High         Low       Close   Adj Close  \
 Date
 2014-12-31  528.344849  529.687500  522.924683  523.521423  523.521423
 2015-01-02  526.114746  528.362366  521.231628  521.937744  521.937744
 2015-01-05  520.396240  521.460388  510.252045  511.057617  511.057617
 2015-01-06  512.181458  513.350037  498.307800  499.212799  499.212799
 2015-01-07  504.225220  504.467896  496.915436  498.357513  498.357513
 2015-01-08  495.264526  500.724487  488.312805  499.928864  499.928864
 2015-01-09  501.997498  502.156616  492.082062  493.454498  493.454498
 2015-01-12  492.231232  493.261566  484.891632  489.854309  489.854309
 2015-01-13  496.109894  500.227234  489.695190  493.464447  493.464447
 2015-01-14  491.942810  500.475861  490.301849  498.128784  498.128784
 2015-01-15  502.803040  502.912445  495.035797  499.043732  499.043732
 2015-01-16  497.273468  505.408722  497.263519  505.299316  505.299316
 2015-01-20  508.203339  509.695129  503.246613  504.125763  504.125763
 2015-01-21  504.473846  516.437988  503.429596  515.204773  515.204773
 2015-01-22  518.625977  533.394714  516.855713  531.465332  531.465332
 2015-01-23  532.658752  539.202759  530.082947  536.994873  536.994873
 2015-01-26  535.582642  536.050110  526.771179  532.280823  532.280823
 2015-01-27  527.069519  527.795532  515.354004  515.791565  515.791565
 2015-01-28  519.918884  520.127686  507.208801  507.208801  507.208801
 2015-01-29  508.203339  508.292847  498.456970  507.865204  507.865204
 2015-01-30  513.036743  536.915344  512.698608  531.594604  531.594604
 2015-02-02  528.819885  530.082947  515.712036  525.587646  525.587646
 2015-02-03  525.110291  530.480713  520.396240  526.343506  526.343506
 2015-02-04  526.343506  529.756714  518.417114  519.898987  519.898987
 2015-02-05  520.923340  525.607544  519.232666  524.692566  524.692566
 2015-02-06  524.752258  534.259949  523.528992  528.093872  528.093872
 2015-02-09  525.110291  529.088379  523.141113  524.941223  524.941223
 2015-02-10  526.403198  534.757202  524.036194  534.001343  534.001343
 2015-02-11  532.370361  535.503113  530.458862  533.036682  533.036682
 2015-02-12  534.309692  541.838257  531.746765  539.958557  539.958557
 ...                ...         ...         ...         ...         ...
 2015-11-18  727.580017  741.409973  727.000000  740.000000  740.000000
 2015-11-19  738.739990  742.000000  737.429993  738.409973  738.409973
 2015-11-20  746.530029  757.919983  743.000000  756.599976  756.599976
 2015-11-23  757.450012  762.708008  751.820007  755.979980  755.979980
 2015-11-24  752.000000  755.278992  737.630005  748.280029  748.280029
 2015-11-25  748.140015  752.000000  746.059998  748.150024  748.150024
 2015-11-27  748.460022  753.409973  747.489990  750.260010  750.260010
 2015-11-30  748.809998  754.929993  741.270020  742.599976  742.599976
 2015-12-01  747.109985  768.950012  746.700012  767.039978  767.039978
 2015-12-02  768.900024  775.955017  758.960022  762.380005  762.380005
 2015-12-03  766.010010  768.994995  745.630005  752.539978  752.539978
 2015-12-04  753.099976  768.489990  750.000000  766.809998  766.809998
 2015-12-07  767.770020  768.729980  755.090027  763.250000  763.250000
 2015-12-08  757.890015  764.799988  754.200012  762.369995  762.369995
 2015-12-09  759.169983  764.229980  737.000977  751.609985  751.609985
 2015-12-10  752.849976  755.849976  743.830017  749.460022  749.460022
 2015-12-11  741.159973  745.710022  736.750000  738.869995  738.869995
 2015-12-14  741.789978  748.729980  724.169983  747.770020  747.770020
 2015-12-15  753.000000  758.080017  743.010010  743.400024  743.400024
 2015-12-16  750.000000  760.590027  739.434998  758.090027  758.090027
 2015-12-17  762.419983  762.679993  749.000000  749.429993  749.429993
 2015-12-18  746.510010  754.130005  738.150024  739.309998  739.309998
 2015-12-21  746.130005  750.000000  740.000000  747.770020  747.770020
 2015-12-22  751.650024  754.849976  745.530029  750.000000  750.000000
 2015-12-23  753.469971  754.210022  744.000000  750.309998  750.309998
 2015-12-24  749.549988  751.349976  746.619995  748.400024  748.400024
 2015-12-28  752.919983  762.989990  749.520020  762.510010  762.510010
 2015-12-29  766.690002  779.979980  766.429993  776.599976  776.599976
 2015-12-30  776.599976  777.599976  766.900024  771.000000  771.000000
 2015-12-31  769.500000  769.500000  758.340027  758.880005  758.880005

              Volume
 Date
 2014-12-31  1372000
 2015-01-02  1447600
 2015-01-05  2059800
 2015-01-06  2899900
 2015-01-07  2065100
 2015-01-08  3353600
 2015-01-09  2069400
 2015-01-12  2322400
 2015-01-13  2370500
 2015-01-14  2235700
 2015-01-15  2715800
 2015-01-16  2298300
 2015-01-20  2227900
 2015-01-21  2268700
 2015-01-22  2676900
 2015-01-23  2273000
 2015-01-26  1543700
 2015-01-27  1904000
 2015-01-28  1683800
 2015-01-29  4186400
 2015-01-30  5606400
 2015-02-02  2849800
 2015-02-03  2034800
 2015-02-04  1663700
 2015-02-05  1849800
 2015-02-06  1749400
 2015-02-09  1267800
 2015-02-10  1749900
 2015-02-11  1377800
 2015-02-12  1620200
 ...             ...
 2015-11-18  1684300
 2015-11-19  1327100
 2015-11-20  2212300
 2015-11-23  1414500
 2015-11-24  2333100
 2015-11-25  1122100
 2015-11-27   838500
 2015-11-30  2097600
 2015-12-01  2134600
 2015-12-02  2230400
 2015-12-03  2590600
 2015-12-04  2757300
 2015-12-07  1812300
 2015-12-08  1829500
 2015-12-09  2700000
 2015-12-10  1984900
 2015-12-11  2224400
 2015-12-14  2412500
 2015-12-15  2666200
 2015-12-16  1993300
 2015-12-17  1553400
 2015-12-18  3148700
 2015-12-21  1525700
 2015-12-22  1365400
 2015-12-23  1565900
 2015-12-24   527200
 2015-12-28  1515300
 2015-12-29  1765000
 2015-12-30  1293300
 2015-12-31  1500900

 [253 rows x 6 columns],
 'IBM':                   Open        High         Low       Close   Adj Close  \
 Date
 2014-12-31  160.410004  161.500000  160.380005  160.440002  142.670593
 2015-01-02  161.309998  163.309998  161.000000  162.059998  144.111176
 2015-01-05  161.270004  161.270004  159.190002  159.509995  141.843597
 2015-01-06  159.669998  159.960007  155.169998  156.070007  138.784607
 2015-01-07  157.199997  157.199997  154.029999  155.050003  137.877548
 2015-01-08  156.240005  159.039993  155.550003  158.419998  140.874313
 2015-01-09  158.419998  160.339996  157.250000  159.110001  141.487869
 2015-01-12  159.000000  159.250000  155.759995  156.440002  139.113632
 2015-01-13  157.259995  159.970001  155.679993  156.809998  139.442627
 2015-01-14  154.860001  156.490005  153.740005  155.800003  138.544495
 2015-01-15  156.690002  156.970001  154.160004  154.570007  137.450714
 2015-01-16  153.820007  157.630005  153.820007  157.139999  139.736084
 2015-01-20  156.699997  157.330002  154.029999  156.949997  139.567123
 2015-01-21  153.029999  154.500000  151.070007  152.089996  135.245392
 2015-01-22  151.940002  155.720001  151.759995  155.389999  138.179916
 2015-01-23  155.029999  157.600006  154.889999  155.869995  138.606735
 2015-01-26  158.259995  159.460007  155.770004  156.360001  139.042511
 2015-01-27  154.940002  155.089996  152.589996  153.669998  136.650406
 2015-01-28  154.000000  154.529999  151.550003  151.550003  134.765213
 2015-01-29  151.380005  155.580002  149.520004  155.479996  138.259933
 2015-01-30  153.910004  155.240005  153.039993  153.309998  136.330276
 2015-02-02  154.000000  154.660004  151.509995  154.660004  137.530746
 2015-02-03  154.750000  158.600006  154.750000  158.470001  140.918762
 2015-02-04  157.210007  158.710007  156.699997  156.960007  139.576035
 2015-02-05  157.289993  158.589996  157.149994  157.910004  140.420792
 2015-02-06  157.339996  158.080002  156.229996  156.720001  140.340225
 2015-02-09  156.000000  157.500000  155.399994  155.750000  139.471573
 2015-02-10  156.740005  158.559998  155.080002  158.559998  141.987900
 2015-02-11  157.759995  159.089996  157.169998  158.199997  141.665527
 2015-02-12  158.720001  159.500000  158.089996  158.520004  141.952072
 ...                ...         ...         ...         ...         ...
 2015-11-18  134.789993  135.910004  134.259995  135.820007  124.721367
 2015-11-19  136.210007  137.740005  136.009995  136.740005  125.566177
 2015-11-20  137.369995  138.919998  137.250000  138.500000  127.182365
 2015-11-23  138.529999  138.869995  137.119995  138.460007  127.145668
 2015-11-24  137.649994  139.339996  137.309998  138.600006  127.274200
 2015-11-25  138.369995  138.429993  137.380005  138.000000  126.723198
 2015-11-27  138.000000  138.809998  137.210007  138.460007  127.145668
 2015-11-30  138.610001  139.899994  138.520004  139.419998  128.027191
 2015-12-01  139.580002  141.399994  139.580002  141.279999  129.735199
 2015-12-02  140.929993  141.210007  139.500000  139.699997  128.284302
 2015-12-03  140.100006  140.729996  138.190002  138.919998  127.568031
 2015-12-04  138.089996  141.020004  137.990005  140.429993  128.954636
 2015-12-07  140.160004  140.410004  138.809998  139.550003  128.146576
 2015-12-08  138.279999  139.059998  137.529999  138.050003  126.769150
 2015-12-09  137.380005  139.839996  136.229996  136.610001  125.446800
 2015-12-10  137.029999  137.850006  135.720001  136.779999  125.602928
 2015-12-11  135.229996  135.440002  133.910004  134.570007  123.573502
 2015-12-14  135.309998  136.139999  134.020004  135.929993  124.822380
 2015-12-15  137.399994  138.970001  137.279999  137.789993  126.530403
 2015-12-16  139.119995  139.649994  137.789993  139.289993  127.907799
 2015-12-17  139.350006  139.500000  136.309998  136.750000  125.575371
 2015-12-18  136.410004  136.960007  134.270004  134.899994  123.876534
 2015-12-21  135.830002  135.830002  134.020004  135.500000  124.427521
 2015-12-22  135.880005  138.190002  135.649994  137.929993  126.658936
 2015-12-23  138.300003  139.309998  138.110001  138.539993  127.219078
 2015-12-24  138.429993  138.880005  138.110001  138.250000  126.952782
 2015-12-28  137.740005  138.039993  136.539993  137.610001  126.365082
 2015-12-29  138.250000  140.059998  138.199997  139.779999  128.357773
 2015-12-30  139.580002  140.440002  139.220001  139.339996  127.953697
 2015-12-31  139.070007  139.100006  137.570007  137.619995  126.374275

               Volume
 Date
 2014-12-31   4011900
 2015-01-02   5525500
 2015-01-05   4880400
 2015-01-06   6146700
 2015-01-07   4701800
 2015-01-08   4236800
 2015-01-09   4484800
 2015-01-12   4182800
 2015-01-13   4377500
 2015-01-14   4690300
 2015-01-15   4248400
 2015-01-16   5756000
 2015-01-20   8017800
 2015-01-21  11897100
 2015-01-22   6120100
 2015-01-23   4812200
 2015-01-26   7888100
 2015-01-27   5659600
 2015-01-28   4495900
 2015-01-29   8320800
 2015-01-30   6563600
 2015-02-02   4712200
 2015-02-03   5536300
 2015-02-04   3678500
 2015-02-05   5253600
 2015-02-06   3225000
 2015-02-09   3057700
 2015-02-10   4440600
 2015-02-11   3626700
 2015-02-12   3333100
 ...              ...
 2015-11-18   4149200
 2015-11-19   4753600
 2015-11-20   5176400
 2015-11-23   5137900
 2015-11-24   3407700
 2015-11-25   3238200
 2015-11-27   1415800
 2015-11-30   4545600
 2015-12-01   4195100
 2015-12-02   3725400
 2015-12-03   5909600
 2015-12-04   4571600
 2015-12-07   3279400
 2015-12-08   3905200
 2015-12-09   4615000
 2015-12-10   4754800
 2015-12-11   5333800
 2015-12-14   5103800
 2015-12-15   4238500
 2015-12-16   4345500
 2015-12-17   4089500
 2015-12-18  10026100
 2015-12-21   5617500
 2015-12-22   4081000
 2015-12-23   5164900
 2015-12-24   1495200
 2015-12-28   3106900
 2015-12-29   3943700
 2015-12-30   2989400
 2015-12-31   3462100

 [253 rows x 6 columns],
 'MSFT':                  Open       High        Low      Close  Adj Close     Volume
 Date
 2014-12-31  46.730000  47.439999  46.450001  46.450001  42.848759   21552500
 2015-01-02  46.660000  47.419998  46.540001  46.759998  43.134731   27913900
 2015-01-05  46.369999  46.730000  46.250000  46.330002  42.738068   39673900
 2015-01-06  46.380001  46.750000  45.540001  45.650002  42.110783   36447900
 2015-01-07  45.980000  46.459999  45.490002  46.230000  42.645821   29114100
 2015-01-08  46.750000  47.750000  46.720001  47.590000  43.900375   29645200
 2015-01-09  47.610001  47.820000  46.900002  47.189999  43.531395   23942800
 2015-01-12  47.419998  47.540001  46.360001  46.599998  42.987125   23651900
 2015-01-13  46.970001  47.910000  46.060001  46.360001  42.765739   35270600
 2015-01-14  45.959999  46.240002  45.619999  45.959999  42.396748   29719600
 2015-01-15  46.220001  46.380001  45.410000  45.480000  41.953972   32750800
 2015-01-16  45.310001  46.279999  45.169998  46.240002  42.655052   35695300
 2015-01-20  46.299999  46.650002  45.570000  46.389999  42.793411   36041400
 2015-01-21  45.939999  46.139999  45.480000  45.919998  42.359852   39081100
 2015-01-22  46.380001  47.139999  46.080002  47.130001  43.476040   35898000
 2015-01-23  47.360001  47.389999  46.799999  47.180000  43.522160   26047800
 2015-01-26  47.000000  47.130001  46.240002  47.009998  43.365341   42525500
 2015-01-27  42.950001  43.200001  42.110001  42.660000  39.352604  169164000
 2015-01-28  42.740002  42.790001  41.160000  41.189999  37.996563   84507100
 2015-01-29  40.930000  42.119999  40.790001  42.009998  38.752991   63585300
 2015-01-30  41.549999  41.580002  40.349998  40.400002  37.267822   78004900
 2015-02-02  40.590000  41.369999  40.230000  41.279999  38.079586   50352500
 2015-02-03  41.630001  41.930000  41.049999  41.599998  38.374779   51890200
 2015-02-04  41.939999  42.209999  41.360001  41.840000  38.596172   41614800
 2015-02-05  42.220001  42.639999  41.860001  42.450001  39.158882   36548200
 2015-02-06  42.680000  42.790001  42.150002  42.410000  39.121983   34311700
 2015-02-09  42.240002  42.740002  42.209999  42.360001  39.075855   31381100
 2015-02-10  42.740002  42.770000  42.180000  42.599998  39.297253   29670700
 2015-02-11  42.650002  42.650002  42.209999  42.380001  39.094311   38262500

In [57]:
# price = pd.DataFrame({tic: data['Close'] for tic, data in all_data.items()})
# volume = pd.DataFrame({tic: data['Volume'] for tic, data in all_data.items()})

In [58]:
# price.head()

In [59]:
# volume.head()

In [60]:
# returns = price.pct_change()

In [61]:
# returns.tail()

In [62]:
# returns.MSFT.corr(returns.IBM)

# returns.MSFT.cov(returns.IBM)

# returns.corr()

# returns.cov()

##  유일 값, 값 세기, 멤버십

In [63]:
obj = Series(['c', 'a', 'd', 'a', 'a', 'b', 'b', 'c', 'c'])

- unique 함수는 Series에서 중복되는 값을 제거하고 유일 값만 담고 있는 Series를 반환한다.
- 유일 값은 정렬된 순서로 반환되지 않지만 uniques.sort() 등으로 정렬할 수 있다.

In [64]:
uniques = obj.unique()

In [65]:
uniques

array(['c', 'a', 'd', 'b'], dtype=object)

- value_counts는 Series에서 빈도수를 계산하여 반환한다.

In [66]:
obj.value_counts()

c    3
a    3
b    2
d    1
dtype: int64

In [67]:
pd.value_counts(obj.values, sort=False)

d    1
a    3
c    3
b    2
dtype: int64

- isin 메서드는 어떤 값이 Series에 있는지 나타내는 불리언 벡터를 반환한다.
- Series나 DataFrame의 칼럼에서 값을 골라내고 싶을 때 유용하다.

In [68]:
mask = obj.isin(['b', 'c'])

In [69]:
mask

0     True
1    False
2    False
3    False
4    False
5     True
6     True
7     True
8     True
dtype: bool

In [70]:
obj[mask]

0    c
5    b
6    b
7    c
8    c
dtype: object

* isin: Series의 각 원소가 넘겨받은 연속된 값에 속하는지를 나타내는 불리언 배열을 반환
* unique: Series에서 중복되는 값을 제거하고 유일한 값만 포함하는 배열을 반환. 결과는 Series에서 발견된 순서대로 반환된다.
* value_counts: Series에서 유일 값에 대한 색인 값과 도수를 계산한다. 결과는 도수 값의 내림차순으로 정렬된다.

* DataFrame의 여러 로우에 대해 히스토그램을 구하는 경우가 있다.
- value_counts를 이용하여 DataFrame의 여러 로우에 대한 히스토그램을 구할 수 있다.

In [71]:
data = DataFrame({'Qu1': [1, 3, 4, 3, 4],
                  'Qu2': [2, 3, 1, 2, 3],
                  'Qu3': [1, 5, 2, 4, 4]})

In [72]:
data

   Qu1  Qu2  Qu3
0    1    2    1
1    3    3    5
2    4    1    2
3    3    2    4
4    4    3    4

In [73]:
result = data.apply(pd.value_counts).fillna(0)

In [74]:
result

   Qu1  Qu2  Qu3
1  1.0  1.0  1.0
2  0.0  2.0  1.0
3  2.0  2.0  0.0
4  2.0  0.0  2.0
5  0.0  0.0  1.0

- value_counts 메서드의 결과가 DataFrame의 칼럼 크기보다 작을 수 있기 때문에 fillna(0) 함수를 이용하여 비어있는 값은 0으로 채운다.

## 누락된 데이터 처리하기

* pandas의 설계 목표 중 하나는 누락 데이터를 가능한 한 쉽게 처리할 수 있도록 하는 것이다.
* 예를들어 pandas 객체의 모든 기술통계는 누락된 데이터를 배제하고 처리한다.
* pandas는 누락된 모든 데이터를 NaN으로 취급한다.

In [75]:
string_data = Series(['aardvark', 'artichoke', np.nan, 'avocado'])

In [76]:
string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [77]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

- 파이썬의 None 값도 NaN으로 취급한다.

In [78]:
string_data[0] = None

In [79]:
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

- NA 처리 메서드
- dropna 누락된 데이터가 있는 축(로우, 칼럼)을 제외시킨다. 어느 정도의 누락 데이터까지 용인할 것인지 지정할 수 있다.
- fillna 누락된 데이터를 대신할 값을 채우거나 ffill, bfill 같은 보간 메서드를 적용할 수 있다.
- isnull 누락되거나 NA인 값을 알려주는 불리언 값이 저장된 같은 형의 객체를 반환한다.
- notnull isnull과 반대 메서드

## 누락된 데이터 골라내기

In [80]:
from numpy import nan as NA

In [81]:
data = Series([1, NA, 3.5, NA, 7])

- dropna를 사용하면 실제 데이터가 들어있는 색인 값과 데이터를 Series 값으로 반환한다.

In [82]:
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

- 불리언 색인을 이용해서 직접 계산하는 것도 가능하다.

In [83]:
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

- DataFrame의 경우 모두 NA인 로우나 컬럼을 제외하던가 하나로도 NA인 값을 포함하고 있는 로우나 컬럼을 제외시킬 수도 있다.
- dropna는 기본적으로 NA 값이 하나라도 있는 로우는 제외시킨다.

In [84]:
data = DataFrame([[1, 6.5, 3], [1, NA, NA],
                  [NA, NA, NA], [NA, 6.5, 3]])

In [85]:
cleaned = data.dropna()

In [86]:
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [87]:
cleaned

     0    1    2
0  1.0  6.5  3.0

- how='all' 옵션을 주면 모든 값이 NA인 로우만 제외한다.

In [88]:
data.dropna(how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [89]:
data[4] = NA

In [90]:
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

- 칼럼을 제외시키는 방법은 옵션을 axis = 1을 주면 로우를 제외시키는 것과 동일한 방식으로 동작한다.

In [91]:
data.dropna(axis=1, how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

- DataFrame의 로우를 제외시키는 방법은 주로 시계열 데이터에 사용되는 경향이 있다.
- 몇 개 이상의 값이 들어있는 로우만 살펴보고 싶다면 thresh 인자에 원가는 값을 넘긴다.

In [92]:
df = DataFrame(np.random.randn(7, 3))

In [93]:
df.iloc[:4, 1] = NA

In [94]:
df

          0         1         2
0 -1.052373       NaN -0.411970
1  1.746951       NaN -0.346550
2 -0.686166       NaN -0.788329
3 -2.587315       NaN  0.816862
4  0.179641  0.065361 -0.459199
5  0.191915  0.127385 -1.246686
6  1.789645 -0.198595 -1.473911

In [95]:
df.iloc[:2, 2] = NA

In [96]:
df

          0         1         2
0 -1.052373       NaN       NaN
1  1.746951       NaN       NaN
2 -0.686166       NaN -0.788329
3 -2.587315       NaN  0.816862
4  0.179641  0.065361 -0.459199
5  0.191915  0.127385 -1.246686
6  1.789645 -0.198595 -1.473911

In [97]:
df.dropna(thresh=2)

          0         1         2
2 -0.686166       NaN -0.788329
3 -2.587315       NaN  0.816862
4  0.179641  0.065361 -0.459199
5  0.191915  0.127385 -1.246686
6  1.789645 -0.198595 -1.473911

In [98]:
df.dropna(thresh=3)

          0         1         2
4  0.179641  0.065361 -0.459199
5  0.191915  0.127385 -1.246686
6  1.789645 -0.198595 -1.473911

## 누락된 값 채우기

* fillna 메서드에 채워 넣고 싶은 값을 넘겨주면 된다.

In [99]:
df.fillna(0)

          0         1         2
0 -1.052373  0.000000  0.000000
1  1.746951  0.000000  0.000000
2 -0.686166  0.000000 -0.788329
3 -2.587315  0.000000  0.816862
4  0.179641  0.065361 -0.459199
5  0.191915  0.127385 -1.246686
6  1.789645 -0.198595 -1.473911

- fillna에 사전 값을 넘겨서 각 칼럼마다 다른 값을 채워 넣을 수도 있다.

In [100]:
df.fillna({1: 0.5, 3: -1})

          0         1         2
0 -1.052373  0.500000       NaN
1  1.746951  0.500000       NaN
2 -0.686166  0.500000 -0.788329
3 -2.587315  0.500000  0.816862
4  0.179641  0.065361 -0.459199
5  0.191915  0.127385 -1.246686
6  1.789645 -0.198595 -1.473911

- fillna는 새로운 객체를 반환하지만 기존 객체를 변경할 수도 있다.

In [101]:
_ = df.fillna(0, inplace=True)

In [102]:
df

          0         1         2
0 -1.052373  0.000000  0.000000
1  1.746951  0.000000  0.000000
2 -0.686166  0.000000 -0.788329
3 -2.587315  0.000000  0.816862
4  0.179641  0.065361 -0.459199
5  0.191915  0.127385 -1.246686
6  1.789645 -0.198595 -1.473911

- 재색인에서 사용 가능한 보간 메서드는 fillna 메서드에서도 사용 가능하다.

In [103]:
df = DataFrame(np.random.randn(6, 3))

In [104]:
df.loc[2:, 1] = NA

In [105]:
df

          0         1         2
0  2.334556  2.660436  0.364522
1  0.071727  1.614825  0.466044
2  0.022779       NaN -0.430263
3  0.626103       NaN  1.250226
4  0.005508       NaN  0.233961
5 -0.007715       NaN -0.711516

In [106]:
df.iloc[4:, 2] = NA

In [107]:
df

          0         1         2
0  2.334556  2.660436  0.364522
1  0.071727  1.614825  0.466044
2  0.022779       NaN -0.430263
3  0.626103       NaN  1.250226
4  0.005508       NaN       NaN
5 -0.007715       NaN       NaN

In [108]:
df.fillna(method='ffill')

          0         1         2
0  2.334556  2.660436  0.364522
1  0.071727  1.614825  0.466044
2  0.022779  1.614825 -0.430263
3  0.626103  1.614825  1.250226
4  0.005508  1.614825  1.250226
5 -0.007715  1.614825  1.250226

In [109]:
df.fillna(method='bfill')

          0         1         2
0  2.334556  2.660436  0.364522
1  0.071727  1.614825  0.466044
2  0.022779       NaN -0.430263
3  0.626103       NaN  1.250226
4  0.005508       NaN       NaN
5 -0.007715       NaN       NaN

In [110]:
df.fillna(method='ffill', limit=1)

          0         1         2
0  2.334556  2.660436  0.364522
1  0.071727  1.614825  0.466044
2  0.022779  1.614825 -0.430263
3  0.626103       NaN  1.250226
4  0.005508       NaN  1.250226
5 -0.007715       NaN       NaN

- 조금만 창의적으로 생각하면 fillna를 이용해서 다양한 일을 할 수 있다.
- 예를 들면 Series의 평균 값이나 중간 값을 전달할 수도 있다.

In [111]:
data = Series([1, NA, 3.5, NA, 7])

In [112]:
data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

- fillna 함수의 인자는 다음과 같다.
- value: 비어있는 값을 채울 스칼라 값이나 사전 형식의 객체
- method: 보간 방식. 기본적으로 ffill을 사용한다.
- axis: 값을 채워 넣을 축. 기본 값은 0
- inplace: 본사본을 생성하지 않고 호출한 객체를 변경한다. 기본값은 False
- limit: 값을 앞, 뒤에서부터 몇 개까지 채울지 결정한다.

## 계층적 색인 Hierarchical indexing

- 축에 대해 다중 색인을 지정할 수 있다.

In [113]:
data = Series(np.random.randn(10),
              index=[['a', 'a', 'a', 'b', 'b', 'b', 'c', 'c', 'd', 'd'],
                     [1, 2, 3, 1, 2, 3, 1, 2, 2, 3]])

In [114]:
data

a  1    0.977364
   2   -0.830257
   3   -1.472570
b  1    1.207880
   2    0.945203
   3    1.736838
c  1    0.068221
   2   -1.054363
d  2   -2.644025
   3   -0.893660
dtype: float64

- 위 객체는 MultiIndex를 색인으로 하는 Series
- 상위 단계의 색인을 이용해서 하위 계층을 직접 접근할 수 있다.

In [115]:
data.index

MultiIndex(levels=[['a', 'b', 'c', 'd'], [1, 2, 3]],
           labels=[[0, 0, 0, 1, 1, 1, 2, 2, 3, 3], [0, 1, 2, 0, 1, 2, 0, 1, 1, 2]])

- 계층적으로 색인된 객체는 데이터의 부분집합을 부분적 색인으로 접근(partial indexing)하는 것이 가능하다.

In [116]:
data['b']

1    1.207880
2    0.945203
3    1.736838
dtype: float64

In [117]:
data['b':'c']

b  1    1.207880
   2    0.945203
   3    1.736838
c  1    0.068221
   2   -1.054363
dtype: float64

In [118]:
data.loc[['b', 'c']]

b  1    1.207880
   2    0.945203
   3    1.736838
c  1    0.068221
   2   -1.054363
dtype: float64

- 하위 계층의 객체를 선택하는 것도 가능하다.

In [119]:
data[:, 2]

a   -0.830257
b    0.945203
c   -1.054363
d   -2.644025
dtype: float64

- 계층적인 색인은 데이터를 재형성하고 피벗 테이블 생성 같은 그룹 기반의 작업을 할 때 중요하게 사용된다.
- 예를들어 DataFrame 객체에 unstack 메서드를 사용하여 데이터를 새롭게 배열할 수도 있다.

In [120]:
data.unstack()

          1         2         3
a  0.977364 -0.830257 -1.472570
b  1.207880  0.945203  1.736838
c  0.068221 -1.054363       NaN
d       NaN -2.644025 -0.893660

In [121]:
data.unstack().stack()

a  1    0.977364
   2   -0.830257
   3   -1.472570
b  1    1.207880
   2    0.945203
   3    1.736838
c  1    0.068221
   2   -1.054363
d  2   -2.644025
   3   -0.893660
dtype: float64

- DataFrame에서는 두 축 모두 계층적 색인을 가질 수 있다.

In [122]:
frame = DataFrame(np.arange(12).reshape((4, 3)),
                  index=[['a', 'a', 'b', 'b'], [1, 2, 1, 2]],
                  columns=[['Ohio', 'Ohio', 'Colorado'],
                           ['Green', 'Red', 'Green']])

In [123]:
frame

     Ohio     Colorado
    Green Red    Green
a 1     0   1        2
  2     3   4        5
b 1     6   7        8
  2     9  10       11

- 계층적 색인의 각 단계는 이름(어떤 파이썬 객체라도 가능하다.)을 가질 수 있다.
- 이름이 있다면 콘솔 출력 시에 함께 나타난다.
- 색인의 이름과 축의 라벨을 혼동하지 말자.

In [124]:
frame.index.names = ['key1', 'key2']

In [125]:
frame.columns.names = ['state', 'color']

In [126]:
frame

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

- 칼럼의 부분집합도 partial indexing으로 접근할 수 있다.

In [127]:
frame['Ohio']

color      Green  Red
key1 key2
a    1         0    1
     2         3    4
b    1         6    7
     2         9   10

* MultiIndex는 따로 생성한 다음에 재사용이 가능하다.

In [128]:
pd.MultiIndex.from_arrays([['Ohio', 'Ohio', 'Colorado'], ['Green', 'Red', 'Green']],
                       names=['state', 'color'])

MultiIndex(levels=[['Colorado', 'Ohio'], ['Green', 'Red']],
           labels=[[1, 1, 0], [0, 1, 0]],
           names=['state', 'color'])

## 계층 순서 바꾸고 정렬하기

* 계층적 색인에서 계층 순서를 바꾸거나 지정된 계층에 따라 데이터를 정렬해야 하는 경우도 있다.
* swaplevel은 넘겨받은 2개의 계층 번호나 이름이 바뀐 새로운 객체를 반환한다.
* 데이터는 변경되지 않는다.

In [129]:
frame

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [130]:
frame.swaplevel('key1', 'key2')

state      Ohio     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
2    a        3   4        5
1    b        6   7        8
2    b        9  10       11

* sortlevel 메서드는 단일 계층에 속한 데이터를 정렬한다.
* swaplevel을 사용해서 계층을 바꿀 때 대개는 sortlevel을 사용해서 결과도 사전식으로 정렬한다.

In [131]:
frame

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [132]:
frame.sortlevel(1)

c:\programdata\anaconda3\envs\py36\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: sortlevel is deprecated, use sort_index(level= ...)
  """Entry point for launching an IPython kernel.

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
b    1        6   7        8
a    2        3   4        5
b    2        9  10       11

In [133]:
frame.sort_index(level=1)

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
b    1        6   7        8
a    2        3   4        5
b    2        9  10       11

In [134]:
frame.swaplevel('key1', 'key2').sort_index(0)

state      Ohio     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
     b        6   7        8
2    a        3   4        5
     b        9  10       11

* 객체가 계층적 색인으로 상위 계층부터 사전식으로 정렬이 되어 있다면 데이터를 선택하는 성능이 훨씬 좋아진다.

## 단계별 요약통계

* DataFrame과 Series의 많은 기술통계와 요약통계는 level 옵션을 가지고 있다.
* 이것은 어떤 한 축에 대해 합을 구하고 싶은 단계를 지정할 수 있는 옵션이다.
* DataFrame에서 로우나 칼럼을 단계별로 정렬하여 합을 구할 수 있다.

In [135]:
frame.sum(level='key2')

state  Ohio     Colorado
color Green Red    Green
key2
1         6   8       10
2        12  14       16

In [136]:
frame.sum(level='color', axis=1)

color      Green  Red
key1 key2
a    1         2    1
     2         8    4
b    1        14    7
     2        20   10

* 내부적으로 pandas의 groupby 기능을 이용하여 구현된다.

## DataFrame 칼럼 사용하기

In [137]:
frame = DataFrame({'a': range(7), 'b':range(7, 0, -1),
                   'c': ['one', 'one', 'one', 'two', 'two', 'two', 'two'],
                   'd': [0, 1, 2, 0, 1, 2, 3]})

In [138]:
frame

   a  b    c  d
0  0  7  one  0
1  1  6  one  1
2  2  5  one  2
3  3  4  two  0
4  4  3  two  1
5  5  2  two  2
6  6  1  two  3

* DataFrame의 set_index 함수는 하나 이상의 칼럼을 색인으로 하는 새로운 DataFrame을 생성한다.

In [139]:
frame2 = frame.set_index(['c', 'd'])

In [140]:
frame2

       a  b
c   d
one 0  0  7
    1  1  6
    2  2  5
two 0  3  4
    1  4  3
    2  5  2
    3  6  1

* 명시적으로 남겨두지 않으면 set_index에 사용된 컬럼은 삭제된다.

In [141]:
frame.set_index(['c', 'd'], drop=False)

       a  b    c  d
c   d
one 0  0  7  one  0
    1  1  6  one  1
    2  2  5  one  2
two 0  3  4  two  0
    1  4  3  two  1
    2  5  2  two  2
    3  6  1  two  3

* reset_index 함수는 set_index와 반대되는 개념으로 계층적 색인 단계가 칼럼으로 이동한다.

In [142]:
frame2.reset_index()

     c  d  a  b
0  one  0  0  7
1  one  1  1  6
2  one  2  2  5
3  two  0  3  4
4  two  1  4  3
5  two  2  5  2
6  two  3  6  1

## 정수 색인

* pandas 객체를 정수로 색인해서 사용하는 일은 파이썬에서 리스트나 튜플 같은 기본 자료 구조에서 사용되는 색인의 의미와 약간 다르다.

In [143]:
ser = Series(np.arange(3))

In [144]:
ser

0    0
1    1
2    2
dtype: int32

In [145]:
# ser[-1] # 오류발생

* 정수 색은은 사용자가 원하는 것이 위치 색인인지 이름 색인인지 알아맞히는 것은 어렵다.

In [146]:
ser2 = Series(np.arange(3), index=['a', 'b', 'c'])

In [147]:
ser2

a    0
b    1
c    2
dtype: int32

In [148]:
ser2[-1]

2

* 정수 색인이 아니라면 위치 색인과 이름 색인을 구분하기 쉽다.